namespace GetFit.Migrations
{
    using Microsoft.AspNet.Identity;
    using Microsoft.AspNet.Identity.EntityFramework;
    using Models;
    using System;
    using System.Data.Entity.Migrations;
    using System.Linq;

    internal sealed class Configuration : DbMigrationsConfiguration<ApplicationDbContext>
    {
        public Configuration()
        {
            AutomaticMigrationsEnabled = true;
            AutomaticMigrationDataLossAllowed = true;
        }

        protected override void Seed(ApplicationDbContext context)
        {
            if (!context.Users.Any())
            {
                // If the database is empty, populate sample data in it

                CreateUser(context, "admin@gmail.com", "123", "System Administrator");
                CreateUser(context, "pesho@gmail.com", "123", "Peter Ivanov");
                CreateUser(context, "merry@gmail.com", "123", "Maria Petrova");
                CreateUser(context, "geshu@gmail.com", "123", "George Petrov");

                CreateRole(context, "Administrators");
                AddUserToRole(context, "admin@gmail.com", "Administrators");

                CreatePost(context,
                    title: "Бърз метаболизъм – бавен метаболизъм",
                    body: @"<p>За съжаление организмът ни не се подчинява на нашите суетни желания, а на свои собствени и логически биологични закони. Защо културистите, дори когато свалят тегло, пак се хранят доста и на често? Защо най-добрата ви приятелка, за да отслабне, започва да яде по едно пакетче солети на ден и пак остава гладна и дебела? Какво знаят и прилагат атлетите, което убягва на останалите?</p>
                    <p>Бавният метаболизъм често служи като оправдание за хората, които не могат да отслабнат. Повдигат рамене и казват, че си е до структура, генетика и такъв им бил метаболизмът.
Много хора, които напълняват постоянно или не могат да свалят излишните килограми, заявяват: Имам бавен метаболизъм. Удобно, но невярно.Дори да имате бавен метаболизъм, това не означава, че ви е съдено да сте с наднормено тегло до края на живота ви.
От друга страна, всички имаме познати, които поглъщат огромни количества храна, без да повишат теглото си и с грам...И нерядко тайничко им завиждаме, разбира се.
Ще се опитаме да разберем дали и доколко предопределен е нашият метаболизъм ни и как влияе начинът ни на живот и хранене върху него.</p>
                    <p> Метаболизъм - това е обмяната на веществата в организма.Съответно метаболизирането е процес на постоянна трансформация на веществата и енергията при процесите на органично съграждане и разграждане.
Обмяната на веществата представлява основно свойство на живия организъм и обхваща хиляди отделни реакции, свързани помежду си в метаболитни пътища и вериги.Метаболизмът е съвкупност от два основни и взаимно свързани процеса: анаболизъм и катаболизъм.
С термина анаболизъм се означава процесът на усвояване на приетите хранителни вещества, изграждането и обновяването на тъканите.
Това са всички реакции, при които организмът синтезира съединения от по - прости предшественици.Те са в основата на растежа, увеличаването на мускулната маса, натрупването на подкожни мазнини и по правило са енергоконсумиращи – използват значителни количества енергия за осъществяването си.
Разграждането на веществата до по - прости такива, при което се освобождава енергия, се наричакатаболизъм.Тази енергия може да произхожда от приетите хранителни вещества, но може и да е предварително натрупана в организма под формата на гликоген и мазнини.
На пръв поглед анаболизмът и катаболизмът са два противоположни процеса, но всъщност те протичат паралелно – постоянно се синтезират и постоянно се разграждат вещества в организма с цел неговото самообновяване и функциониране.За да се случва това, е необходима енергията, която доставяме чрез храната – тя или изгаря, или се натрупва в организма(най - вече като мазнини).
</p>",
                    date: new DateTime(2016, 03, 27, 17, 53, 48),
                    authorUsername: "merry@gmail.com"
                );

                CreatePost(context,
                    title: "Калориен баланс",
                    body: @"<p>Ако поетата от храната енергия удовлетворява точно енергийните потребности на организма без излишък, анаболизмът и катаболизмът се намират в баланс помежду си и теглото не се променя.</p>

<p>Това е основната обмяна на веществата - базов метаболизъм, който се измерва в калории за едно денонощие при състояние на пълен покой. В тези случаи приетите калории са колкото изгорените, т.е. налице е калориен баланс.</p>
<p>Ако приетите с храната калории са повече, отколкото са необходими на организма за поддържане на жизнените му функции, анаболните процеси започват да надделяват над катаболните и теглото се покачва – мускули, при трениране и правилно хранене, или мазнини (в повечето случаи). В тези ситуации калорийният баланс е положителен.</p>
<p>Съответно, отрицателен калориен баланс се наблюдава, ако се приемат по-малко калории, отколкото се горят.</p>
<p>Тогава преобладават катаболните процеси и организмът разгражда синтезирани вече тъкани (най-вече мускулна и мастна), за да попълни енергийните си депа. В резултат на това е налице загуба на тегло.</p>",
                   date: new DateTime(2016, 05, 11, 08, 22, 03),
                    authorUsername: "merry@gmail.com"
                );

                CreatePost(context,
                    title: "Как да ускорим метаболизма си?",
                    body: @"<p>Толкова ли е лесно обаче, колкото изглежда? Колкото и банално да звучи, истината е една: метаболизмът се забързва със спорт и здравословно хранене.</p>
                    <p> Вместо да мислите и смятате колко калории имаше в последния сандвич, по - добре си изградете стратегия за ускоряване на базовия си метаболизъм.Тогава калориите в сандвича няма да ви притесняват.</p>
                    < p > На първо място - трениране с тежести(ако досега не сте го правили) - усилената мускулна работа ускорява метаболизма в продължение на часове след тренировката.Монотонното кардио заменете с интервална кардио тренировка.
Обменните процеси се ускоряват след всяко хранене.Затова се хранете често и с малки порции.Така ще усвоите пълноценно хранителните вещества и няма да предизвикате негативен отговор от страна на метаболизма за дългите часове, през които сте без храна.
Стремете се да се храните на интервали не по - големи от четири часа.
Винаги закусвайте, защото пропускането на закуската ще се възприеме от организма като гладуване и съответно метаболизмът ще се забави с цел пестене на хранителните вещества.
Не допускайте твърде бърза загуба на тегло – тогава губите и много мускули.А мускулите са основната централа за горене на калории и колкото по - малко са те, толкова по - бавен е и метаболизмът.</p> ",
                    date: new DateTime(2016, 03, 27, 17, 53, 48),
                    authorUsername: "merry@gmail.com"
                );

                CreatePost(context,
                    title: "Бърз метаболизъм – няма мускули?!",
                    body: @"<p>Заблудата, че хората с бърз метаболизъм по-бавно качват мускули произлиза оттам, че те рядко приемат достатъчно калории, тъй като прага на калорийният баланс при тях е доста висок.</p>
                    <p>Заблудата, че хората с бърз метаболизъм по-бавно качват мускули произлиза оттам, че те рядко приемат достатъчно калории, тъй като прага на калорийният баланс при тях е доста висок.</p>",
                    date: new DateTime(2016, 02, 18, 22, 14, 38),
                    authorUsername: "pesho@gmail.com"
                );

                CreatePost(context,
                    title: "Колкото по-малко спим, толкова повече слабеем?",
                    body: @"<p>
Това изглежда напълно логично. По време на сън обмяната на веществата се забавя и се изразходва по-малко енергия. Значи, ако спим по-малко... мазнините ще се топят по-бързо.</p>
                    <p>Всъщност е точно обратното. Учените смятат, че пълноценният сън е абсолютно необходима част от процеса на отслабване.</p>
                    
                    <p>Изследователи от Чикагския университет са изучавали състоянието на здрави хора, лишени от нормален сън, и са стигнали до извода, че ако спим дори и час по-малко, отколкото ни е необходимо, това може да доведе до хормонален дисбаланс.

В тези случаи нивото на хормона лептин, който сигнализира на мозъка за ситостта на стомаха, намалява, а нивото на хормона грелин, който сигнализира за глад, се увеличава.</p>",
                    date: new DateTime(2016, 04, 11, 19, 02, 05),
                    authorUsername: "geshu@gmail.com"
                );

                CreatePost(context,
                    title: "Предопределеният метаболизъм",
                    body: @"<p>До известна степен метаболизмът се предопределя генетично. Свързан е с нивата на експресия на определени хормони (най-вече тироидните).</p>
                    <p>Стресът, диетите, видовете упражнения и лекарствата също могат да окажат съществено влияние върху обмяната на веществата. Наследствеността е важен фактор, но това не означава, че наднорменото тегло задължително е предопределено.</p>
                    <p>Интересен е въпросът могат ли диетите да забавят метаболизма. Могат, разбира се. Една неправилно конструирана диета може да забави метаболизма с 5-10 %, особено ако рязко се намали приемът на калории. </p>
<p>Ясно е, че за да сваляте тегло, все пак трябва да сте в отрицателен калориен баланс. Но този знак минус трябва да получите предимно чрез увеличаване на енергоразхода, а не толкова чрез намаляване на енергоприема. </p>
<p>Затова винаги преди започване на хранителен режим за редукция на теглото се обръща внимание на индивидуалната двигателна активност и активната маса. Едва тогава се предприема конкретна редукция на калорийния прием. Ако тя е прекалено голяма обаче, отново ще се стигне до забавяне на метаболизма. </p>
<p>По-точният метод за определяне на калорийната рестрикция е процентният. Намаляване на калориите с около 15-20 % гарантира, че няма да има голяма загуба на мускулна тъкан, но не и липсата на спад в метаболизма, дори и след по-дълъг период от време.</p>",
                    date: new DateTime(2016, 06, 30, 17, 36, 52),
                    authorUsername: "merry@gmail.com"
                );

                context.SaveChanges();
            }
        }

        private void CreateUser(ApplicationDbContext context,
            string email, string password, string fullName)
        {
            var userManager = new UserManager<ApplicationUser>(
                new UserStore<ApplicationUser>(context));
            userManager.PasswordValidator = new PasswordValidator
            {
                RequiredLength = 1,
                RequireNonLetterOrDigit = false,
                RequireDigit = false,
                RequireLowercase = false,
                RequireUppercase = false,
            };

            var user = new ApplicationUser
            {
                UserName = email,
                Email = email,
                FullName = fullName
            };

            var userCreateResult = userManager.Create(user, password);
            if (!userCreateResult.Succeeded)
            {
                throw new Exception(string.Join("; ", userCreateResult.Errors));
            }
        }

        private void CreateRole(ApplicationDbContext context, string roleName)
        {
            var roleManager = new RoleManager<IdentityRole>(
                new RoleStore<IdentityRole>(context));
            var roleCreateResult = roleManager.Create(new IdentityRole(roleName));
            if (!roleCreateResult.Succeeded)
            {
                throw new Exception(string.Join("; ", roleCreateResult.Errors));
            }
        }

        private void AddUserToRole(ApplicationDbContext context, string userName, string roleName)
        {
            var user = context.Users.First(u => u.UserName == userName);
            var userManager = new UserManager<ApplicationUser>(
                new UserStore<ApplicationUser>(context));
            var addAdminRoleResult = userManager.AddToRole(user.Id, roleName);
            if (!addAdminRoleResult.Succeeded)
            {
                throw new Exception(string.Join("; ", addAdminRoleResult.Errors));
            }
        }

        private void CreatePost(ApplicationDbContext context,
            string title, string body, DateTime date, string authorUsername)
        {
            var post = new Post();
            post.Title = title;
            post.Body = body;
            post.Date = date;
            post.Author = context.Users.Where(u => u.UserName == authorUsername).FirstOrDefault();
            context.Post.Add(post);
        }
    }
}
